DebtManagment/src/Catalogs/Долги/Долги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Долги</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДолга</name>
    <type>
      <types>EnumRef.ВидыДолга</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПередачиВРаботу</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияРаботы</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусРаботыСДолгом</name>
    <type>
      <types>EnumRef.СтатусыРаботыСДолгом</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДоговораДолжника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтадияДолга</name>
    <type>
      <types>EnumRef.СтадииДолга</types>
    </type>
  </attributes>
  <attributes>
    <name>УИДДолжника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПервоначальныййКредитор</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КоллекторскийПроцентПоДоговору</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерДоговораСКонтрагентом</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеДоговораЦессии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерДоговораЦесссии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоговораЦессии</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПереходаПравТребования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеПереходаПравТребования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>РазмерКредита</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаКредита</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОстатокОД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаЗадолженности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

DebtManagment/src/InformationRegisters/СтатусыРаботыСДолгом/СтатусыРаботыСДолгом.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыРаботыСДолгом</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>СтатусРаботыСДолгом</name>
    <type>
      <types>EnumRef.СтатусыРаботыСДолгом</types>
    </type>
  </resources>
  <dimensions>
    <name>Долг</name>
    <type>
      <types>CatalogRef.Долги</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Реестр</name>
    <type>
      <types>DocumentRef.РеестрДолжников</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

DebtManagment/src/Documents/СменаСтатусаРаботыСДолгами/СменаСтатусаРаботыСДолгами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СменаСтатусаРаботыСДолгами</name>
  <registerRecords>InformationRegister.СтатусыРаботыСДолгом</registerRecords>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Реестр</name>
    <type>
      <types>DocumentRef.РеестрДолжников</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НовыйСтатусРаботыСДолгом</name>
    <type>
      <types>EnumRef.СтатусыРаботыСДолгом</types>
    </type>
  </attributes>
  <attributes>
    <name>Долг</name>
    <type>
      <types>CatalogRef.Долги</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Долги</name>
    <attributes>
      <name>Долг</name>
      <type>
        <types>CatalogRef.Долги</types>
      </type>
    </attributes>
    <attributes>
      <name>НовыйСтатусРаботыСДолгом</name>
      <type>
        <types>EnumRef.СтатусыРаботыСДолгом</types>
      </type>
    </attributes>
    <attributes>
      <name>Реестр</name>
      <type>
        <types>DocumentRef.РеестрДолжников</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

DebtManagment/src/Catalogs/Долги/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
	//Если Не Параметры.Свойство("Владелец",Объект.Владелец) тогда   
	//	Отказ = Истина;
	//КонецЕсли;   
	СтатусРаботыСДолгом =ПолучитьСтатусРаботыСДолгом(Объект.Ссылка,ТекущаяДата());
КонецПроцедуры                   

&НаСервере
Функция ПолучитьСтатусРаботыСДолгом(Долг,НаДату)  
	    	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтатусыРаботыСДолгомСрезПоследних.СтатусРаботыСДолгом КАК СтатусРаботыСДолгом
		|ИЗ
		|	РегистрСведений.СтатусыРаботыСДолгом.СрезПоследних(&НаДату, Долг = &Долг) КАК СтатусыРаботыСДолгомСрезПоследних";
	
	Запрос.УстановитьПараметр("Долг", Долг);
	Запрос.УстановитьПараметр("НаДату", НаДату);
	Результат=Запрос.Выполнить().Выбрать(); 
	Результат.Следующий();
	Возврат Результат.СтатусРаботыСДолгом;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

КонецФункции

&НаКлиенте
Процедура СтатусРаботыСДолгомНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		СтарыйСтатус=СтатусРаботыСДолгом;

КонецПроцедуры

&НаКлиенте
Процедура СтатусРаботыСДолгомПриИзменении(Элемент)
	// Вставить содержимое обработчика.   
		Если СтатусРаботыСДолгом<>СтарыйСтатус тогда
	//Сообщить(Объект.СтатусДействия);              
	ОповещениеВопрос = Новый ОписаниеОповещения("ПослеОтветаСменаСтатуса",ЭтотОбъект);
	ПоказатьВопрос(ОповещениеВопрос,"Сменить статус договора?",РежимДиалогаВопрос.ДаНет);
	
	КонецЕсли;

КонецПроцедуры 

&НаКлиенте
Процедура ПослеОтветаСменаСтатуса(Результат, Параметры) Экспорт // здесь, думаю, комментировать нечего
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		//Сообщить("Открываем смену статуса");
		СоздатьДокументСменыСтатуса();
	Иначе
		Объект.СтатусДействия = СтарыйСтатус;
	КонецЕсли;
КонецПроцедуры
	
&НаКлиенте
Процедура СтатусДействияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	СтарыйСтатус=Объект.СтатусДействия;
КонецПроцедуры

&НаКлиенте
Процедура	СоздатьДокументСменыСтатуса()
	ПараметрыЗаполнения=Новый Структура;
	ПараметрыЗаполнения.Вставить("Дата",ТекущаяДата());
	ПараметрыЗаполнения.Вставить("Долг",Объект.Ссылка);
	ПараметрыЗаполнения.Вставить("НовыйСтатусРаботыСДолгом",СтатусРаботыСДолгом);
	ПараметрыЗаполнения.Вставить("ЗаполнитьПриОткрытии",Истина);
	ОткрытьФорму("Документ.СменаСтатусаРаботыСДолгами.Форма.ФормаДокумента",ПараметрыЗаполнения,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры
